{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          1
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<unk>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "current_score_card_13": 3,
      "current_score_card_11": 4,
      "current_score_card_12": 5,
      "current_score_card_10": 6,
      "current_score_card_9": 7,
      "current_score_card_7": 8,
      "current_score_card_8": 9,
      "current_score_card_5": 10,
      "current_score_card_6": 11,
      "current_score_card_3": 12,
      "current_score_card_4": 13,
      "current_score_card_1": 14,
      "current_score_card_2": 15,
      "opponent_score_0": 16,
      "player_score_0": 17,
      "opponent_score_13": 18,
      "opponent_score_12": 19,
      "opponent_score_21": 20,
      "opponent_score_17": 21,
      "opponent_score_11": 22,
      "opponent_score_23": 23,
      "opponent_score_19": 24,
      "opponent_score_20": 25,
      "opponent_score_18": 26,
      "opponent_score_22": 27,
      "opponent_score_15": 28,
      "opponent_score_16": 29,
      "opponent_score_24": 30,
      "opponent_score_25": 31,
      "opponent_score_14": 32,
      "player_score_13": 33,
      "opponent_score_26": 34,
      "opponent_score_27": 35,
      "opponent_score_10": 36,
      "opponent_score_28": 37,
      "opponent_score_9": 38,
      "opponent_score_29": 39,
      "player_score_12": 40,
      "opponent_score_30": 41,
      "player_score_23": 42,
      "player_score_21": 43,
      "opponent_score_31": 44,
      "player_score_25": 45,
      "player_score_11": 46,
      "player_score_24": 47,
      "opponent_score_8": 48,
      "player_score_22": 49,
      "player_hand_1_2_4_7_8_9_10_11_12_13": 50,
      "opponent_score_32": 51,
      "player_score_19": 52,
      "player_score_30": 53,
      "opponent_score_7": 54,
      "player_score_36": 55,
      "player_score_34": 56,
      "player_score_20": 57,
      "player_score_33": 58,
      "player_score_31": 59,
      "player_score_29": 60,
      "player_score_32": 61,
      "player_score_35": 62,
      "player_score_28": 63,
      "player_score_27": 64,
      "player_score_18": 65,
      "player_score_37": 66,
      "player_score_17": 67,
      "player_score_26": 68,
      "player_score_38": 69,
      "opponent_score_33": 70,
      "player_score_10": 71,
      "player_score_39": 72,
      "player_score_40": 73,
      "player_score_16": 74,
      "player_score_41": 75,
      "player_score_15": 76,
      "opponent_score_34": 77,
      "player_score_42": 78,
      "opponent_score_6": 79,
      "player_score_9": 80,
      "player_score_46": 81,
      "player_score_43": 82,
      "player_hand_1_2_4_5_7_8_9_10_11_12_13": 83,
      "player_hand_1_2_4_6_7_8_9_10_11_12_13": 84,
      "opponent_score_5": 85,
      "player_score_14": 86,
      "opp_cards_played_3": 87,
      "opponent_score_35": 88,
      "player_score_44": 89,
      "player_score_45": 90,
      "player_score_47": 91,
      "opponent_score_36": 92,
      "opponent_score_3": 93,
      "player_score_8": 94,
      "player_score_7": 95,
      "player_score_48": 96,
      "opponent_score_4": 97,
      "opponent_score_37": 98,
      "player_score_49": 99,
      "player_hand_1_4_7_8_9_10_11_12": 100,
      "opponent_score_1": 101,
      "opponent_score_38": 102,
      "player_score_6": 103,
      "opponent_score_2": 104,
      "opp_cards_played_3_6": 105,
      "player_score_50": 106,
      "player_score_5": 107,
      "opponent_score_39": 108,
      "player_score_51": 109,
      "opp_cards_played_3_5_6": 110,
      "player_hand_1_4_7_8_10_11_12": 111,
      "opp_cards_played_3_5": 112,
      "player_score_4": 113,
      "opponent_score_40": 114,
      "player_score_52": 115,
      "player_score_3": 116,
      "player_hand_1_2_4_7_8_9_10_11_12": 117,
      "player_score_53": 118,
      "opponent_score_41": 119,
      "player_score_2": 120,
      "player_hand_1_4_5_6_7_8_9_10_11_12_13": 121,
      "player_hand_1_4_5_6_7_8_10_11_12_13": 122,
      "player_score_1": 123,
      "opponent_score_42": 124,
      "player_score_54": 125,
      "player_hand_1_4_7_8_9_10_11_12_13": 126,
      "player_hand_13": 127,
      "player_score_55": 128,
      "current_score_card_15": 129,
      "opp_cards_played_2_3": 130,
      "current_score_card_14": 131,
      "opponent_score_43": 132,
      "player_hand_1_2_4_5_7_8_10_11_12_13": 133,
      "opp_cards_played_2_3_5_6_13": 134,
      "player_hand_1_13": 135,
      "current_score_card_16": 136,
      "current_score_card_17": 137,
      "player_hand_8": 138,
      "player_score_56": 139,
      "player_hand_1_2_7_8_9_10_11_12_13": 140,
      "player_hand_4_7_8_10_11_12": 141,
      "player_score_57": 142,
      "opp_cards_played_2_3_9": 143,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10_11_12": 144,
      "player_hand_1_2_5_6_7_8_9_10_11_12_13": 145,
      "opp_cards_played_2_3_5_6_9_13": 146,
      "opponent_score_44": 147,
      "current_score_card_19": 148,
      "player_hand_11": 149,
      "player_hand_1_2_4_5_6_7_8_9_10_12_13": 150,
      "current_score_card_18": 151,
      "opp_cards_played_3_5_6_13": 152,
      "opp_cards_played_1_2_3_4_5_6_7_9_10_11_12_13": 153,
      "opp_cards_played_2_3_4_5_6_7_8_9_10_11_12_13": 154,
      "player_hand_1_2_4_7_8_10_11_12_13": 155,
      "player_hand_7": 156,
      "player_hand_4_13": 157,
      "player_score_58": 158,
      "player_hand_12": 159,
      "opponent_score_45": 160,
      "player_hand_8_13": 161,
      "player_hand_1_4_6_7_8_11_12_13": 162,
      "player_hand_1_2_4_6_7_8_10_11_12_13": 163,
      "player_hand_1_2_4_6_7_8_11_12_13": 164,
      "opp_cards_played_1_2_3_5_6_7_8_9_10_11_12_13": 165,
      "player_hand_1": 166,
      "player_hand_4_8_10_11_12": 167,
      "opp_cards_played_1_2_3_4_5_6_8_9_10_11_12_13": 168,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10_12_13": 169,
      "opp_cards_played_2_3_4_5_6_7_8_9_10_11_12": 170,
      "player_hand_4": 171,
      "opp_cards_played_1_3_4_5_6_7_8_9_10_11_12_13": 172,
      "player_hand_1_7_8_10_11_12": 173,
      "player_hand_1_2_7_8_10_11_12_13": 174,
      "player_hand_10_13": 175,
      "player_hand_7_11": 176,
      "player_score_59": 177,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10_11_13": 178,
      "player_hand_7_8_10_11_12": 179,
      "player_hand_1_2_4_5_6_7_8_9_10_11_12": 180,
      "current_score_card_21": 181,
      "current_score_card_20": 182,
      "opp_cards_played_3_6_9": 183,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_11_12_13": 184,
      "player_hand_1_2_4_6_7_8_9_10_12_13": 185,
      "player_hand_1_4_5_6_7_8_10_11_12": 186,
      "opp_cards_played_1_2_3_4_6_7_8_9_10_11_12_13": 187,
      "player_hand_10": 188,
      "opp_cards_played_1_2_3_5_6_7_8_9_10_11_12": 189,
      "player_hand_5_8": 190,
      "opp_cards_played_3_11": 191,
      "prev_score_cards_2_3_4_5_6_7_8_9_10_11_12_13": 192,
      "prev_score_cards_1_2_3_4_6_7_8_9_10_11_12_13": 193,
      "prev_score_cards_1_2_4_5_6_7_8_9_10_11_12_13": 194,
      "prev_score_cards_1_3_4_5_6_7_8_9_10_11_12_13": 195,
      "prev_score_cards_1_2_3_5_6_7_8_9_10_11_12_13": 196,
      "player_hand_7_8": 197,
      "prev_score_cards_1_2_3_4_5_6_7_9_10_11_12_13": 198,
      "prev_score_cards_1_2_3_4_5_7_8_9_10_11_12_13": 199,
      "opp_cards_played_1_2_3_4_5_7_8_9_10_11_12_13": 200,
      "prev_score_cards_1_2_3_4_5_6_7_8_10_11_12_13": 201,
      "prev_score_cards_1_2_3_4_5_6_8_9_10_11_12_13": 202,
      "player_hand_11_12": 203,
      "player_hand_2": 204,
      "player_score_60": 205,
      "opp_cards_played_3_4": 206,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_10_12_13": 207,
      "player_hand_11_13": 208,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_11_12_13": 209,
      "player_hand_1_2_4_5_6_7_8_10_11_12_13": 210,
      "opp_cards_played_1_2_3_4_5_6_7_8_10_11_12_13": 211,
      "opp_cards_played_2_3_5_6": 212,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_10_11_13": 213,
      "opp_cards_played_1_2_4_5_6_7_8_9_10_11_12_13": 214,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_10_11_12": 215,
      "player_hand_5": 216,
      "player_hand_7_10_11": 217,
      "opp_cards_played_3_9": 218,
      "player_hand_1_4_5_6_7_8_10_12_13": 219,
      "player_hand_2_4_7_8_10_11_12_13": 220,
      "player_hand_1_2_5_6_7_8_10_11_12_13": 221,
      "player_hand_10_11": 222,
      "opp_cards_played_1_2_3_4_5_6_8_9_10_12_13": 223,
      "player_hand_1_2_7_8_10_11_13": 224,
      "player_hand_1_2_4_5_6_7_8_9_10_11_12_13": 225,
      "player_hand_1_2_5_7_8_9_10_11_12_13": 226,
      "opp_cards_played_1_2_3_4_6_7_9_10_11_12_13": 227,
      "current_score_card_22": 228,
      "player_hand_12_13": 229,
      "player_score_61": 230,
      "current_score_card_23": 231,
      "opp_cards_played_2_3_9_13": 232,
      "opp_cards_played_3_4_5_6": 233,
      "opp_cards_played_1_2_3_4_5_6_7_9_10_11_12": 234,
      "opp_cards_played_1_2_3_5_6_9_13": 235,
      "player_hand_7_13": 236,
      "player_hand_8_10": 237,
      "player_hand_4_8": 238,
      "player_hand_4_8_13": 239,
      "player_hand_2_7_8_10_11_12_13": 240,
      "player_hand_1_2_4_5_8_9_10_11_12_13": 241,
      "player_hand_6": 242,
      "player_hand_1_11_13": 243,
      "player_hand_1_8": 244,
      "player_hand_7_10_11_12": 245,
      "player_hand_4_11_12": 246,
      "opp_cards_played_3_5_9": 247,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_11_12": 248,
      "opp_cards_played_1_2_3_4_5_6_9_10_11_12_13": 249,
      "prev_score_cards_11": 250,
      "player_score_62": 251,
      "player_hand_1_4_7_8_9_10_11": 252,
      "prev_score_cards_13": 253,
      "player_hand_1_8_13": 254,
      "player_hand_4_8_10_11": 255,
      "player_hand_1_2_5_7_8_10_11_12_13": 256,
      "prev_score_cards_12": 257,
      "player_hand_4_12": 258,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10_13": 259,
      "player_hand_1_2_4_5_7_8_9_10_12_13": 260,
      "prev_score_cards_10": 261,
      "opp_cards_played_1_2_3_5_6_7_9_10_11_12_13": 262,
      "opp_cards_played_3_5_6_9": 263,
      "prev_score_cards_9": 264,
      "player_hand_9": 265,
      "opp_cards_played_2_3_4_5_6_9_13": 266,
      "player_hand_1_11": 267,
      "prev_score_cards_6": 268,
      "prev_score_cards_4": 269,
      "opp_cards_played_3_4_5_6_7_8_9_10_11_12_13": 270,
      "opp_cards_played_2_3_5_9_10": 271,
      "player_hand_2_13": 272,
      "prev_score_cards_7": 273,
      "opp_cards_played_3_5_9_10": 274,
      "prev_score_cards_8": 275,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10_12": 276,
      "player_hand_1_2_4_6_7_8_9_10_13": 277,
      "player_score_63": 278,
      "player_hand_1_4_6_7_8_9_10_11_12_13": 279,
      "prev_score_cards_5": 280,
      "player_hand_1_5_8": 281,
      "prev_score_cards_2": 282,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10_11": 283,
      "player_hand_2_8_10_11_12_13": 284,
      "player_hand_8_10_11_12": 285,
      "prev_score_cards_1": 286,
      "player_hand_1_2_4_6_7_9_10_12_13": 287,
      "player_hand_1_2": 288,
      "prev_score_cards_3": 289,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_12_13": 290,
      "opp_cards_played_3_5_11": 291,
      "player_hand_5_13": 292,
      "player_hand_1_2_4_6_7_9_12_13": 293,
      "opp_cards_played_2_3_4_5_6_7_9_10_11_12_13": 294,
      "player_hand_1_2_3_5_6_7_8_9_10_11_12_13": 295,
      "opp_cards_played_1_2_3_4_5_6_9_13": 296,
      "opp_cards_played_1_2_3_4_5_6_8_9_10_11_12": 297,
      "player_hand_8_12": 298,
      "player_hand_1_2_6_7_8_9_10_11_12_13": 299,
      "player_hand_1_2_7_8_10_11": 300,
      "player_hand_4_8_11_12": 301,
      "player_hand_1_2_3_4_6_7_8_9_10_11_12_13": 302,
      "opp_cards_played_1_2_3_5_6_7_8_9_10_11_13": 303,
      "player_hand_1_2_4_5_7_8_9_10_11_12": 304,
      "player_hand_1_4_6_7_8_11_13": 305,
      "opp_cards_played_1_2_3_4_5_6_8_9_12_13": 306,
      "opp_cards_played_1_2_3_5_6_7_9_13": 307,
      "opp_cards_played_2_3_9_11": 308,
      "player_hand_10_11_12": 309,
      "player_hand_1_2_3_4_5_7_8_9_10_11_12_13": 310,
      "opp_cards_played_1_2_3_4_5_6_7_9_11_12_13": 311,
      "opp_cards_played_1_2_3_4_6_7_8_9_10_11_12": 312,
      "opp_cards_played_3_4_5_6_9": 313,
      "player_hand_4_11": 314,
      "player_hand_8_11": 315,
      "player_hand_1_2_11": 316,
      "opp_cards_played_3_13": 317,
      "player_hand_10_12_13": 318,
      "player_hand_1_2_3_4_5_6_8_9_10_11_12_13": 319,
      "player_hand_1_2_5_6_7_8_9_10_11_13": 320,
      "opp_cards_played_2_3_4_5_6_7_8_9_10_12_13": 321,
      "player_hand_1_6_7_8_11_12_13": 322,
      "player_hand_3": 323,
      "opp_cards_played_2_3_5_6_7_8_9_10_11_12_13": 324,
      "opp_cards_played_1_2_3_5_6_7_8_9_10_12_13": 325,
      "player_hand_1_2_3_4_5_6_7_8_10_11_12_13": 326,
      "player_hand_1_2_3_4_5_6_7_9_10_11_12_13": 327,
      "player_hand_1_4_5_6_7_10_12_13": 328,
      "player_hand_4_7_13": 329,
      "prev_score_cards_1_2_3_5_6_8_9_10_11_12_13": 330,
      "current_score_card_24": 331,
      "player_hand_1_2_7_11": 332,
      "player_score_64": 333,
      "opp_cards_played_2_3_4_6_7_9_10_11_12_13": 334,
      "opp_cards_played_2_3_4_6_7_8_9_10_11_12_13": 335,
      "opp_cards_played_1_3_4_5_6_7_8_9_10_11_12": 336,
      "opp_cards_played_3_4_9": 337,
      "prev_score_cards_1_2_3_4_7_8_9_10_11_12_13": 338,
      "prev_score_cards_1_2_3_4_5_6_7_8_11_12_13": 339,
      "player_hand_4_10_11": 340,
      "player_hand_1_2_3_4_5_6_7_8_9_11_12_13": 341,
      "prev_score_cards_2_3_4_5_6_7_9_10_11_12_13": 342,
      "prev_score_cards_1_3_4_5_6_8_9_10_11_12_13": 343,
      "player_hand_1_8_12_13": 344,
      "current_score_card_25": 345,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_10_11": 346,
      "prev_score_cards_1_2_3_4_6_7_9_10_11_12_13": 347,
      "opp_cards_played_1_2_3_5_6_7_8_9_11_12_13": 348,
      "prev_score_cards_1_2_3_4_5_6_7_8_10_11_12": 349,
      "prev_score_cards_1_3_4_5_6_7_9_10_11_12_13": 350,
      "opp_cards_played_3_6_7": 351,
      "prev_score_cards_1_2_3_4_6_7_8_9_10_12_13": 352,
      "prev_score_cards_2_3_5_6_7_8_9_10_11_12_13": 353,
      "prev_score_cards_1_2_3_4_6_7_8_9_11_12_13": 354,
      "opp_cards_played_2_3_4_5_7_8_9_10_11_12_13": 355,
      "prev_score_cards_1_3_4_6_7_8_9_10_11_12_13": 356,
      "prev_score_cards_2_3_4_5_6_7_8_9_10_11_12": 357,
      "player_hand_1_2_5_7_8_9_11_12_13": 358,
      "player_hand_4_8_10": 359,
      "prev_score_cards_1_2_3_4_5_6_7_8_10_12_13": 360,
      "prev_score_cards_1_2_3_4_5_6_9_10_11_12_13": 361,
      "prev_score_cards_1_2_3_4_5_7_8_9_10_12_13": 362,
      "prev_score_cards_1_3_4_5_7_8_9_10_11_12_13": 363,
      "prev_score_cards_2_4_5_6_7_8_9_10_11_12_13": 364,
      "prev_score_cards_1_2_3_4_5_6_7_10_11_12_13": 365,
      "prev_score_cards_1_2_3_4_5_6_8_9_10_12_13": 366,
      "prev_score_cards_2_3_4_5_7_8_9_10_11_12_13": 367,
      "prev_score_cards_1_2_3_4_5_6_7_9_10_12_13": 368,
      "prev_score_cards_1_3_4_5_6_7_8_10_11_12_13": 369,
      "player_hand_4_5_6_7_8_10_11_12": 370,
      "prev_score_cards_2_3_4_5_6_7_8_9_11_12_13": 371,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_11_12": 372,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_11_13": 373,
      "prev_score_cards_2_3_4_5_6_8_9_10_11_12_13": 374,
      "opp_cards_played_1_2_3_4_5_7_8_9_10_11_12": 375,
      "opp_cards_played_1_3_4_5_6_8_9_10_11_12_13": 376,
      "prev_score_cards_1_2_3_5_6_7_8_9_10_11_12": 377,
      "player_hand_1_2_4_5_6_7_8_9_10_11": 378,
      "prev_score_cards_1_2_5_6_7_8_9_10_11_12_13": 379,
      "player_hand_1_2_7_10_11": 380,
      "prev_score_cards_1_2_3_4_5_7_8_9_10_11_13": 381,
      "prev_score_cards_1_2_3_4_5_6_7_9_10_11_13": 382,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_10_12": 383,
      "opp_cards_played_1_2_3_4_5_8_9_10_11_12_13": 384,
      "prev_score_cards_1_2_3_6_7_8_9_10_11_12_13": 385,
      "player_hand_4_7_8": 386,
      "player_hand_6_13": 387,
      "prev_score_cards_1_2_3_4_5_6_8_10_11_12_13": 388,
      "prev_score_cards_1_3_4_5_6_7_8_9_10_12_13": 389,
      "prev_score_cards_1_2_4_5_6_7_8_9_10_12_13": 390,
      "prev_score_cards_1_2_3_4_5_6_7_9_11_12_13": 391,
      "prev_score_cards_1_2_4_5_6_7_8_9_11_12_13": 392,
      "prev_score_cards_1_2_3_4_6_7_8_9_10_11_12": 393,
      "prev_score_cards_2_3_4_5_6_7_8_10_11_12_13": 394,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_12_13": 395,
      "prev_score_cards_1_2_3_5_6_7_8_9_10_11_13": 396,
      "prev_score_cards_1_2_3_5_6_7_8_9_10_12_13": 397,
      "opp_cards_played_1_2_3_5_6_7_9_10_11_12": 398,
      "prev_score_cards_1_2_3_4_6_7_8_9_10_11_13": 399,
      "prev_score_cards_1_2_4_6_7_8_9_10_11_12_13": 400,
      "player_hand_1_2_3_4_5_6_7_8_9_10_12_13": 401,
      "prev_score_cards_1_2_3_4_5_8_9_10_11_12_13": 402,
      "prev_score_cards_1_2_4_5_6_7_9_10_11_12_13": 403,
      "opp_cards_played_1_2_3_4_5_6_8_9_13": 404,
      "player_hand_5_12": 405,
      "prev_score_cards_3_4_5_6_7_8_9_10_11_12_13": 406,
      "prev_score_cards_1_3_5_6_7_8_9_10_11_12_13": 407,
      "prev_score_cards_2_3_4_5_6_7_8_9_10_11_13": 408,
      "prev_score_cards_2_3_4_5_6_7_8_9_10_12_13": 409,
      "prev_score_cards_1_2_3_4_5_6_8_9_11_12_13": 410,
      "prev_score_cards_1_3_4_5_6_7_8_9_10_11_12": 411,
      "prev_score_cards_1_2_3_4_5_7_9_10_11_12_13": 412,
      "prev_score_cards_1_2_4_5_7_8_9_10_11_12_13": 413,
      "opp_cards_played_1_2_3_4_5_6_7_9_10_12_13": 414,
      "opp_cards_played_1_2_3_4_6_7_8_9_11_12_13": 415,
      "prev_score_cards_1_2_4_5_6_8_9_10_11_12_13": 416,
      "prev_score_cards_1_2_3_4_5_7_8_10_11_12_13": 417,
      "prev_score_cards_1_2_3_5_6_7_8_10_11_12_13": 418,
      "prev_score_cards_2_3_4_6_7_8_9_10_11_12_13": 419,
      "prev_score_cards_1_2_3_4_5_6_8_9_10_11_12": 420,
      "prev_score_cards_1_2_3_4_5_7_8_9_10_11_12": 421,
      "prev_score_cards_1_2_3_4_5_6_8_9_10_11_13": 422,
      "prev_score_cards_1_2_4_5_6_7_8_9_10_11_13": 423,
      "prev_score_cards_4_13": 424,
      "opp_cards_played_2_3_4_5_6_7_8_9_11_12_13": 425,
      "player_hand_1_4": 426,
      "opp_cards_played_1_2_3_4_6_7_8_9_10_12_13": 427,
      "player_hand_4_7_8_10": 428,
      "prev_score_cards_10_11": 429,
      "opp_cards_played_1_2_3_6_7_8_9_10_11_12_13": 430,
      "prev_score_cards_1_2_3_4_5_6_7_8_10_11_13": 431,
      "prev_score_cards_1_4_5_6_7_8_9_10_11_12_13": 432,
      "prev_score_cards_1_3_4_5_6_7_8_9_10_11_13": 433,
      "opp_cards_played_1_2_3_4_5_6_7_9_10_11_13": 434,
      "player_hand_1_4_7_8_9_10_11_13": 435,
      "opp_cards_played_3_4_6": 436,
      "prev_score_cards_1_2_4_5_6_7_8_9_10_11_12": 437,
      "player_hand_1_2_3_4_5_6_7_8_9_10_11_13": 438,
      "prev_score_cards_1_2_3_5_6_7_9_10_11_12_13": 439,
      "prev_score_cards_10_13": 440,
      "player_hand_2_4_5_7_8_10_11_12_13": 441,
      "player_hand_5_10": 442,
      "prev_score_cards_1_2_3_4_5_6_7_9_10_11_12": 443,
      "player_hand_2_10_12_13": 444,
      "player_hand_4_10": 445,
      "prev_score_cards_1_2_3_5_7_8_9_10_11_12_13": 446,
      "prev_score_cards_1_2_4_5_6_7_8_10_11_12_13": 447,
      "player_hand_8_11_13": 448,
      "prev_score_cards_1_2_3_4_5_6_7_8_9_10_13": 449,
      "prev_score_cards_1_2_3_4_6_7_8_10_11_12_13": 450,
      "opp_cards_played_2_3_4_5_6_7_8_9_10_11_13": 451,
      "prev_score_cards_1_2_3_5_6_7_8_9_11_12_13": 452,
      "opp_cards_played_3_6_11": 453,
      "prev_score_cards_7_8": 454,
      "prev_score_cards_3_13": 455,
      "prev_score_cards_7_13": 456,
      "player_hand_5_11": 457,
      "prev_score_cards_1_3_4_5_6_7_8_9_11_12_13": 458,
      "prev_score_cards_1_2_3_4_6_8_9_10_11_12_13": 459,
      "opp_cards_played_3_4_5_6_9_12": 460,
      "player_hand_1_10_13": 461,
      "player_hand_1_2_4_6_7_8_9_10_11_13": 462,
      "player_hand_2_7": 463,
      "prev_score_cards_2_10": 464,
      "prev_score_cards_9_13": 465,
      "player_hand_6_7": 466,
      "prev_score_cards_3_12": 467,
      "prev_score_cards_4_9": 468,
      "prev_score_cards_8_12": 469,
      "prev_score_cards_9_11": 470,
      "player_hand_1_2_5_8_10_11_12_13": 471,
      "player_hand_2_3_4_5_6_7_8_9_10_11_12_13": 472,
      "player_hand_1_2_7_8_9_11_13": 473,
      "prev_score_cards_6_8": 474,
      "prev_score_cards_1_13": 475,
      "player_hand_1_2_3_4_5_6_7_8_9_10_11_12": 476,
      "player_hand_1_6_8_12_13": 477,
      "prev_score_cards_8_13": 478,
      "prev_score_cards_5_9": 479,
      "prev_score_cards_2_9": 480,
      "prev_score_cards_4_7": 481,
      "prev_score_cards_6_9": 482,
      "prev_score_cards_9_12": 483,
      "prev_score_cards_11_12": 484,
      "player_hand_1_2_4_7_9_12_13": 485,
      "prev_score_cards_1_2_3_4_5_7_8_9_11_12_13": 486,
      "prev_score_cards_2_11": 487,
      "opp_cards_played_1_2_3_4_6_8_9_10_11_12_13": 488,
      "player_hand_1_6": 489,
      "prev_score_cards_6_11": 490,
      "prev_score_cards_11_13": 491,
      "prev_score_cards_4_10": 492,
      "prev_score_cards_2_7": 493,
      "prev_score_cards_3_5": 494,
      "prev_score_cards_3_4": 495,
      "prev_score_cards_7_9": 496,
      "prev_score_cards_9_10": 497,
      "prev_score_cards_3_8": 498,
      "prev_score_cards_12_13": 499,
      "prev_score_cards_1_11": 500,
      "player_hand_2_11": 501,
      "prev_score_cards_4_6": 502,
      "prev_score_cards_4_8": 503,
      "opp_cards_played_2_3_4_5_6_7_8_9_10_12": 504,
      "prev_score_cards_1_8": 505,
      "player_hand_4_7_8_11_12": 506,
      "prev_score_cards_3_10": 507,
      "prev_score_cards_4_11": 508,
      "prev_score_cards_6_13": 509,
      "opp_cards_played_1_3_4_5_6_7_8_9_10_12_13": 510,
      "player_hand_4_6_7_8_9_10_11_12_13": 511,
      "player_hand_1_4_13": 512,
      "prev_score_cards_2_6": 513,
      "opp_cards_played_1_3_5_6_9": 514,
      "player_hand_2_10_11_12_13": 515,
      "opp_cards_played_3_12": 516,
      "prev_score_cards_8_10": 517,
      "prev_score_cards_5_7": 518,
      "prev_score_cards_7_10": 519,
      "player_hand_1_2_7_8_9_10_11_13": 520,
      "prev_score_cards_8_11": 521,
      "prev_score_cards_1_12": 522,
      "prev_score_cards_4_12": 523,
      "player_hand_1_3_4_5_6_7_8_9_10_11_12_13": 524,
      "prev_score_cards_2_12": 525,
      "prev_score_cards_3_7": 526,
      "prev_score_cards_2_13": 527,
      "prev_score_cards_5_12": 528,
      "prev_score_cards_1_9": 529,
      "player_hand_1_12": 530,
      "opp_cards_played_3_4_6_9": 531,
      "prev_score_cards_2_3": 532,
      "player_hand_1_5": 533,
      "prev_score_cards_10_12": 534,
      "prev_score_cards_7_11": 535,
      "opp_cards_played_1_2_3_5_6_7_8_9_10_13": 536,
      "prev_score_cards_6_10": 537,
      "prev_score_cards_3_11": 538,
      "player_hand_1_4_7_9_12_13": 539,
      "prev_score_cards_6_12": 540,
      "prev_score_cards_8_9": 541,
      "prev_score_cards_1_10": 542,
      "prev_score_cards_1_4": 543,
      "opp_cards_played_2_3_4_5_6_8_9_10_11_12_13": 544,
      "prev_score_cards_5_13": 545,
      "prev_score_cards_5_6": 546,
      "player_hand_1_12_13": 547,
      "prev_score_cards_1_3": 548,
      "opp_cards_played_2_3_4_5_6_7_9_10_11_12": 549,
      "prev_score_cards_5_8": 550,
      "prev_score_cards_2_5": 551,
      "prev_score_cards_2_8": 552,
      "prev_score_cards_6_7": 553,
      "prev_score_cards_4_5": 554,
      "opp_cards_played_1_2_3_4_6_7_8_9_10_11_13": 555,
      "player_hand_1_2_4_7_10_11_12_13": 556,
      "prev_score_cards_1_7": 557,
      "prev_score_cards_5_10": 558,
      "opp_cards_played_1_2_3_5_6_8_9_10_11_12_13": 559,
      "prev_score_cards_5_11": 560,
      "player_score_65": 561,
      "prev_score_cards_3_6": 562,
      "opp_cards_played_1_2_3_5_6_7_8_10_11_12_13": 563,
      "prev_score_cards_1_6": 564,
      "prev_score_cards_3_9": 565,
      "prev_score_cards_1_5": 566,
      "prev_score_cards_7_12": 567,
      "opp_cards_played_1_2_3_5_6_8_9_10_11_12": 568,
      "player_hand_1_2_5_6_7_8_10_12_13": 569,
      "prev_score_cards_1_2": 570,
      "player_hand_2_4_5_8_10_11_12_13": 571,
      "opp_cards_played_1_2_3_4_5_6_8_9_11_12_13": 572,
      "prev_score_cards_2_4": 573,
      "opp_cards_played_1_3_4_5_6_7_9_10_11_12_13": 574,
      "player_hand_1_6_7_8_12_13": 575,
      "player_hand_7_12_13": 576,
      "opp_cards_played_3_4_5_6_7_8_9_10_12_13": 577,
      "player_hand_1_2_5_7_8_9_10_11_12": 578,
      "opp_cards_played_1_3_4_6_7_8_9_10_11_12_13": 579,
      "opp_cards_played_1_2_3_5_7_8_9_10_11_12_13": 580,
      "opp_cards_played_1_2_3_4_5_7_9_10_11_12_13": 581,
      "opp_cards_played_2_3_5": 582,
      "opp_cards_played_1_2_3_5_6_7_9_12_13": 583,
      "opp_cards_played_1_2_3_4_5_6_8_9_10_11_13": 584,
      "opp_cards_played_1_2_3_4_6_7_8_10_11_12_13": 585,
      "player_hand_4_7_8_9_10_11": 586,
      "opp_cards_played_1_3_4_5_6_7_8_9_11_12_13": 587,
      "opp_cards_played_1_3_5_6_7_8_9_10_11_12_13": 588,
      "opp_cards_played_2_3_5_6_12_13": 589,
      "opp_cards_played_1_2_3_4_5_6_7_10_11_12_13": 590,
      "opp_cards_played_3_5_11_12": 591,
      "opp_cards_played_1_2_3_4_5_6_8_10_11_12_13": 592,
      "player_hand_7_8_12": 593,
      "player_hand_1_10": 594,
      "player_hand_1_5_7_8_9_11_12_13": 595,
      "opp_cards_played_3_4_12": 596,
      "player_hand_1_6_13": 597,
      "opp_cards_played_1_2_3_4_5_7_8_9_11_12_13": 598,
      "opp_cards_played_1_2_3_4_5_6_7_8_10_12_13": 599,
      "player_hand_1_5_13": 600,
      "opp_cards_played_1_13": 601,
      "player_hand_1_7_8_11_12": 602,
      "opp_cards_played_1_2_3_4_5_6_7_8_10_11_12": 603,
      "opp_cards_played_1_2_3_4_5_6_7_8_10_11_13": 604,
      "opp_cards_played_1_2_3_4_5_7_8_9_10_11_13": 605,
      "opp_cards_played_1_3_4_5_6_7_8_9_10_11_13": 606,
      "player_hand_1_2_4_6_7_9_10_11_12_13": 607,
      "opp_cards_played_1_2_3_4_5_7_8_9_10_12_13": 608,
      "player_hand_1_2_5_6_7_8_9_10_11_12": 609,
      "player_hand_4_5": 610,
      "player_hand_4_6_8_13": 611,
      "opp_cards_played_1_2_3_4_7_8_9_10_11_12_13": 612,
      "opp_cards_played_1_2_4_5_6_8_9_10_11_12_13": 613,
      "player_hand_4_7_8_10_11": 614,
      "player_hand_7_8_11": 615,
      "opp_cards_played_1_2_3_4_5_6_7_8_11_12_13": 616,
      "player_hand_1_4_8_9_10_11_13": 617,
      "opp_cards_played_2_11": 618,
      "opp_cards_played_1_2_3_5_6_7_9_11_12_13": 619,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_11_13": 620,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_11": 621,
      "player_hand_1_4_5_6_7_8_9_11_12_13": 622,
      "player_hand_5_7": 623,
      "player_hand_1_2_5_6_7_8_10_11_13": 624,
      "player_hand_1_2_4_5_7_8_12_13": 625,
      "opp_cards_played_1_2_4_5_6_7_8_9_10_12_13": 626,
      "player_hand_5_8_13": 627,
      "player_score_66": 628,
      "opp_cards_played_3_4_5_6_9_12_13": 629,
      "opp_cards_played_1_2_4_5_6_7_8_9_10_11_13": 630,
      "player_hand_2_4_8_10_11_12_13": 631,
      "opp_cards_played_1_2_3_5_6_9_10_11_12_13": 632,
      "opp_cards_played_1_3_4_5_6_7_8_10_11_12_13": 633,
      "opp_cards_played_1_3_4_5_7_8_9_10_11_12_13": 634,
      "player_hand_2_8": 635,
      "opp_cards_played_1_2_4_5_6_7_8_9_11_12_13": 636,
      "opp_cards_played_2_3_8_9_11": 637,
      "opp_cards_played_1_2_4_5_6_7_8_10_11_12_13": 638,
      "opp_cards_played_2_3_4_5_6_7_8_10_11_12_13": 639,
      "player_hand_4_5_6_7_8_10_12": 640,
      "opp_cards_played_3_4_5_6_8_9_10_12_13": 641,
      "player_hand_1_4_7_9_10_11_12_13": 642,
      "player_hand_4_7": 643,
      "player_hand_1_4_7_13": 644,
      "opp_cards_played_1_2_3_4_5_7_8_10_11_12_13": 645,
      "player_hand_7_10_12_13": 646,
      "opp_cards_played_1_2_4_6_7_8_9_10_11_12_13": 647,
      "opp_cards_played_2_10": 648,
      "opp_cards_played_2_12": 649,
      "player_hand_1_8_11_13": 650,
      "opp_cards_played_1_12": 651,
      "player_hand_7_8_10_12": 652,
      "opp_cards_played_1_10": 653,
      "opp_cards_played_1_2_3_9_13": 654,
      "player_hand_1_4_6_7_11_13": 655,
      "player_hand_1_2_4_5_7_8_9_11_12_13": 656,
      "opp_cards_played_1_11": 657,
      "opp_cards_played_3_5_8_11": 658,
      "player_hand_1_10_11": 659,
      "opp_cards_played_3_10": 660,
      "player_hand_1_7": 661,
      "player_hand_4_8_11": 662,
      "opp_cards_played_12_13": 663,
      "opp_cards_played_1_2_4_5_6_7_8_9_10_11_12": 664,
      "opp_cards_played_1_4": 665,
      "player_hand_1_2_7_10_11_13": 666,
      "player_hand_1_5_6_7_10_12_13": 667,
      "opp_cards_played_1_2_5_6_7_8_9_10_11_12_13": 668,
      "player_hand_1_2_4_5_7_8_13": 669,
      "opp_cards_played_10_13": 670,
      "opp_cards_played_2_3_5_9_10_12": 671,
      "opp_cards_played_11_13": 672,
      "player_hand_11_12_13": 673,
      "opp_cards_played_1_2_4_5_6_7_9_10_11_12_13": 674,
      "player_hand_1_5_8_13": 675,
      "player_hand_1_4_5_7_10_11_12_13": 676,
      "player_hand_1_4_5_7_10_11_13": 677,
      "opp_cards_played_1_2_4_5_7_8_9_10_11_12_13": 678,
      "opp_cards_played_4_12": 679,
      "opp_cards_played_1_9": 680,
      "opp_cards_played_5_11": 681,
      "opp_cards_played_2_9": 682,
      "player_hand_8_9": 683,
      "opp_cards_played_1_3_4_5_6_9": 684,
      "player_hand_4_7_12": 685,
      "player_hand_1_4_5_7_8_10_11_12_13": 686,
      "player_hand_4_6_8_10_13": 687,
      "opp_cards_played_1_3": 688,
      "opp_cards_played_3_8": 689,
      "opp_cards_played_2_4_5_6_7_8_9_10_11_12_13": 690,
      "opp_cards_played_1_2_3_5_6_7_9_10_13": 691,
      "opp_cards_played_2_3_5_6_7_8_9_10_11_12": 692,
      "player_hand_4_6_7_8_10_12": 693,
      "opp_cards_played_1_4_5_6_7_8_9_10_11_12_13": 694,
      "opp_cards_played_3_4_5_6_8_9_12_13": 695,
      "player_hand_1_5_7_8_13": 696,
      "opp_cards_played_2_7": 697,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_13": 698,
      "player_hand_5_7_11": 699,
      "opp_cards_played_3_5_8_10_11": 700,
      "player_hand_7_9": 701,
      "opp_cards_played_1_2_3_5_6_7_8_9_12_13": 702,
      "player_hand_7_8_10": 703,
      "player_hand_1_2_4_5_6_7_8_10_11_13": 704,
      "player_hand_8_10_12": 705,
      "player_hand_1_2_5_7_8_9_10_11_13": 706,
      "opp_cards_played_3_9_12": 707,
      "player_hand_9_13": 708,
      "opp_cards_played_4_11": 709,
      "player_hand_2_5": 710,
      "player_hand_1_2_4_5_7_8_11_12_13": 711,
      "player_hand_1_8_11": 712,
      "player_hand_4_5_8_13": 713,
      "opp_cards_played_9_13": 714,
      "opp_cards_played_1_7": 715,
      "player_hand_1_2_6_7_8_9_10_11_13": 716,
      "player_hand_4_9": 717,
      "opp_cards_played_2_3_4_6_7_8_9_10_11_12": 718,
      "opp_cards_played_5_9": 719,
      "player_hand_6_8": 720,
      "opp_cards_played_2_13": 721,
      "player_hand_1_4_5_7_8_10_11_12": 722,
      "player_hand_4_6_7_8_10_13": 723,
      "player_hand_7_12": 724,
      "opp_cards_played_1_3_4_5_6_7_9": 725,
      "player_hand_1_4_8": 726,
      "player_hand_1_5_7_8_10_11_13": 727,
      "opp_cards_played_2_3_4_5_7_8_9_10_11_12": 728,
      "player_hand_1_2_5_6_7_8_9_10_12_13": 729,
      "player_hand_1_5_7_8_11_13": 730,
      "opp_cards_played_3_7": 731,
      "opp_cards_played_6_13": 732,
      "player_hand_2_12": 733,
      "opp_cards_played_4_9": 734,
      "player_hand_2_10": 735,
      "opp_cards_played_1_2_3_4_5_6_7_9_13": 736,
      "player_hand_1_2_4_5_7_8_9_12_13": 737,
      "opp_cards_played_2_8": 738,
      "opp_cards_played_5_12": 739,
      "opp_cards_played_1_8": 740,
      "player_hand_2_4_6_7_8_9_10_13": 741,
      "opp_cards_played_8_13": 742,
      "player_hand_1_5_6_7_10_13": 743,
      "player_hand_4_6_7_8_11_13": 744,
      "player_hand_1_7_8_9_11_13": 745,
      "opp_cards_played_4_8": 746,
      "opp_cards_played_1_2_3_4_5_6_7_9_10_12": 747,
      "opp_cards_played_7_13": 748,
      "player_hand_5_9": 749,
      "player_hand_1_2_7_8_9_10_12_13": 750,
      "player_hand_7_10_13": 751,
      "opp_cards_played_2_3_4_5_9_10": 752,
      "player_hand_1_2_4_5_7_9_10_11_12_13": 753,
      "player_score_67": 754,
      "opp_cards_played_3_5_12": 755,
      "opp_cards_played_9_10": 756,
      "player_hand_4_5_13": 757,
      "opp_cards_played_5_13": 758,
      "player_hand_1_4_7_10_11_12_13": 759,
      "opp_cards_played_11_12": 760,
      "player_hand_2_8_10_12_13": 761,
      "opp_cards_played_10_11": 762,
      "opp_cards_played_8_12": 763,
      "opp_cards_played_2_3_4_5_6_7_8_9_11_12": 764,
      "opp_cards_played_3_4_9_11": 765,
      "opp_cards_played_10_12": 766,
      "opp_cards_played_8_10": 767,
      "opp_cards_played_2_3_4_5_6_7_9_10_11": 768,
      "player_hand_1_7_11_13": 769,
      "opp_cards_played_1_6": 770,
      "opp_cards_played_5_10": 771,
      "opp_cards_played_2_6": 772,
      "opp_cards_played_6_10": 773,
      "player_hand_1_7_8_9_10_11_12": 774,
      "opp_cards_played_3_4_6_10": 775,
      "opp_cards_played_8_11": 776,
      "player_hand_1_2_4_7_8_10_13": 777,
      "player_hand_9_11": 778,
      "opp_cards_played_1_2_3_4_6_8_9_10_12_13": 779,
      "opp_cards_played_2_3_5_6_8_9_10_11_12": 780,
      "opp_cards_played_3_4_5": 781,
      "player_hand_7_10": 782,
      "player_hand_4_6_7_8_9_10_13": 783,
      "player_hand_1_4_5_7_8_10_13": 784,
      "prev_score_cards_": 785,
      "opp_cards_played_5_7": 786,
      "opp_cards_played_7_12": 787,
      "player_hand_1_2_3_6_7_8_9_10_11_12_13": 788,
      "player_hand_1_2_5_6_7_9_10_11_12": 789,
      "opp_cards_played_3_4_6_7_9": 790,
      "opp_cards_played_7_8": 791,
      "player_hand_2_4_5_7_8_9_10_11_12": 792,
      "player_hand_1_5_7_8_10_13": 793,
      "opp_cards_played_1_2_3_4_6_7_9_10_11_12": 794,
      "opp_cards_played_2_3_4_6_7_9_10_11_12": 795,
      "opp_cards_played_2_4": 796,
      "opp_cards_played_7_11": 797,
      "player_hand_8_10_11": 798,
      "player_hand_1_7_8_9_11_12": 799,
      "opp_cards_played_3_6_10": 800,
      "player_hand_1_2_4_5_8_9_10_11_12": 801,
      "player_hand_1_2_5_7_8_10_11_13": 802,
      "opp_cards_played_1_2": 803,
      "opp_cards_played_2_3_4_5_6_7_8_9_10_11": 804,
      "opp_cards_played_6_7": 805,
      "player_hand_4_9_13": 806,
      "player_hand_9_10": 807,
      "opp_cards_played_1_3_4_5_6_7_8_9_11": 808,
      "player_hand_1_2_4_5_7_8_10_11_13": 809,
      "player_hand_1_2_4_7_8_10_12_13": 810,
      "player_hand_4_7_8_11_13": 811,
      "player_hand_1_7_13": 812,
      "player_hand_1_2_5_7_8_10_12_13": 813,
      "player_hand_1_2_5_7_8_9_10_12_13": 814,
      "player_hand_1_4_10_13": 815,
      "player_hand_7_8_10_11": 816,
      "opp_cards_played_7_10": 817,
      "opp_cards_played_9_12": 818,
      "opp_cards_played_3_12_13": 819,
      "player_hand_1_2_3_4_5_7_9_10_11_12_13": 820,
      "player_hand_1_7_8": 821,
      "player_hand_2_4": 822,
      "opp_cards_played_3_6_13": 823,
      "opp_cards_played_1_2_3_9_11_13": 824,
      "player_hand_4_6": 825,
      "player_hand_1_2_4_5_6_7_8_9_10_11_13": 826,
      "player_hand_2_4_5_10_11_12_13": 827,
      "player_hand_4_5_7_8_13": 828,
      "opp_cards_played_6_12": 829,
      "player_score_68": 830,
      "opp_cards_played_1_2_3_4_5_6_8_9_10_11": 831,
      "opp_cards_played_4_10": 832,
      "player_hand_1_2_5_6_8_10_11_13": 833,
      "player_hand_1_4_5_6_7_8_10_11_13": 834,
      "player_hand_1_8_9_11_13": 835,
      "opp_cards_played_1_3_6_9": 836,
      "opp_cards_played_1_2_3_5_6_9_10_13": 837,
      "opp_cards_played_2_3_5_6_7_9_10_11_12_13": 838,
      "opp_cards_played_3_6_9_10_11": 839,
      "opp_cards_played_4_6": 840,
      "opp_cards_played_2_3_5_6_12": 841,
      "opp_cards_played_2_3_4_5_6_7_8_9_12_13": 842,
      "player_hand_1_2_5_8_11_12_13": 843,
      "player_hand_4_10_11_12": 844,
      "player_hand_4_8_9_10_11_13": 845,
      "player_hand_6_11": 846,
      "opp_cards_played_1_5": 847,
      "opp_cards_played_4_13": 848,
      "opp_cards_played_5_6": 849,
      "player_hand_2_7_11": 850,
      "player_hand_7_8_11_13": 851,
      "player_hand_1_2_5_7_8_11_12_13": 852,
      "player_hand_4_7_10_11_12_13": 853,
      "player_hand_2_7_8_10_11": 854,
      "opp_cards_played_1_2_3_5_6_9_11_12_13": 855,
      "player_hand_7_9_11": 856,
      "player_hand_1_5_8_10": 857,
      "player_hand_1_5_6_7_8_9_10_11_12_13": 858,
      "opp_cards_played_1_2_3_6_7_8_9_10_11_12": 859,
      "opp_cards_played_2_5": 860,
      "player_hand_7_11_12": 861,
      "player_hand_1_5_6_7_8_10_11_13": 862,
      "player_hand_2_12_13": 863,
      "player_hand_1_2_4_5_6_7_8_9_10_13": 864,
      "player_hand_1_2_5_6_7_10_11_12_13": 865,
      "player_hand_1_5_7_8": 866,
      "player_hand_5_7_8_13": 867,
      "opp_cards_played_2_3_8": 868,
      "opp_cards_played_1_2_3_5": 869,
      "player_hand_10_12": 870,
      "player_hand_1_7_8_11": 871,
      "opp_cards_played_3_4_11": 872,
      "player_hand_2_5_7_8_10_12_13": 873,
      "opp_cards_played_2_3_4_5_7_9_10_11": 874,
      "opp_cards_played_1_2_3_4_5_6_9_10_12_13": 875,
      "opp_cards_played_9_11": 876,
      "player_hand_1_5_8_10_13": 877,
      "player_hand_2_6": 878,
      "player_hand_5_10_11": 879,
      "player_hand_1_4_5_7_8_10_11_13": 880,
      "player_hand_8_11_12_13": 881,
      "player_hand_1_4_5_7_8_13": 882,
      "player_hand_1_8_12": 883,
      "opp_cards_played_1_2_3_5_6_8_9_10_11_13": 884,
      "opp_cards_played_3_6_9_10_11_12": 885,
      "player_hand_4_7_10_12_13": 886,
      "opp_cards_played_6_11": 887,
      "player_hand_1_2_3_4_5_6_7_10_11_12_13": 888,
      "player_hand_1_4_12_13": 889,
      "opp_cards_played_2_3_6_9_11_12": 890,
      "player_hand_1_5_6_7_8_11_13": 891,
      "opp_cards_played_3_5_6_8_9": 892,
      "opp_cards_played_1_2_3_4_5_6_9_10_11_13": 893,
      "player_hand_9_12": 894,
      "opp_cards_played_1_2_3_5_9_11_13": 895,
      "opp_cards_played_1_3_4_5_6_7_8_9": 896,
      "player_hand_1_2_10_11_13": 897,
      "player_hand_1_4_5_6_8_10_11_12": 898,
      "opp_cards_played_4_7": 899,
      "opp_cards_played_8_9": 900,
      "opp_cards_played_7_9": 901,
      "player_hand_1_5_7_10_11_13": 902,
      "player_hand_1_8_10_13": 903,
      "player_hand_2_7_8_11": 904,
      "opp_cards_played_3_6_9_10": 905,
      "opp_cards_played_2_3_9_12": 906,
      "player_hand_1_8_9_11": 907,
      "player_hand_7_11_12_13": 908,
      "player_hand_4_8_9_10_13": 909,
      "opp_cards_played_1_3_5": 910,
      "player_hand_1_2_5_6_7_8_11_12_13": 911,
      "opp_cards_played_2_3_4_6_9_10_11_12": 912,
      "player_hand_2_9": 913,
      "player_hand_7_10_11_13": 914,
      "player_hand_8_11_12": 915,
      "opp_cards_played_3_4_9_12": 916,
      "opp_cards_played_2_3_6_9_13": 917,
      "opp_cards_played_2_3_4_6_7_9_11_12_13": 918,
      "player_hand_1_2_3_5_7_8_9_10_11_12_13": 919,
      "opp_cards_played_1_2_3_5_6_7_9_10_12_13": 920,
      "opp_cards_played_2_3_5_8_9_10_12": 921,
      "opp_cards_played_4_5": 922,
      "player_hand_1_2_3_4_6_7_9_10_11_12_13": 923,
      "player_hand_1_2_4_6_7_8_9_10_11_12": 924,
      "player_hand_1_2_7_8_9_10_13": 925,
      "player_hand_1_5_7_10_12_13": 926,
      "player_hand_1_2_3_4_6_8_9_10_11_12_13": 927,
      "player_hand_4_8_10_13": 928,
      "player_hand_5_8_10": 929,
      "opp_cards_played_3_5_6_8_10_11": 930,
      "player_hand_1_4_6_7_8_9_11_12_13": 931,
      "player_hand_2_10_13": 932,
      "player_hand_1_4_5_7_8_9_10_11_12_13": 933,
      "opp_cards_played_2_3_4_6_9_10_12": 934,
      "player_hand_2_5_7_8_9_10_11_12": 935,
      "player_hand_6_12": 936,
      "player_hand_1_2_3_4_5_8_9_10_11_12_13": 937,
      "player_hand_1_2_3_5_6_8_9_10_11_12_13": 938,
      "player_hand_2_4_6_7_8_9_10_11_12_13": 939,
      "player_hand_5_6": 940,
      "player_hand_1_7_11_12_13": 941,
      "player_hand_1_4_7_8_11": 942,
      "opp_cards_played_3_6_9_12": 943,
      "player_hand_1_10_11_13": 944,
      "opp_cards_played_6_9": 945,
      "player_hand_4_10_13": 946,
      "player_hand_5_7_8_10_13": 947,
      "opp_cards_played_2_3_10": 948,
      "opp_cards_played_5_8": 949,
      "opp_cards_played_2_3_4_5_9_10_11": 950,
      "opp_cards_played_2_3_5_6_8_10_11": 951,
      "player_hand_4_6_8_9_10_11_12_13": 952,
      "player_hand_1_4_7_8_10_11": 953,
      "player_hand_1_4_7_11_13": 954,
      "player_hand_1_9": 955,
      "player_hand_1_2_3_4_5_6_8_9_11_12_13": 956,
      "player_hand_5_10_13": 957,
      "player_hand_1_2_3_4_5_6_8_9_10_12_13": 958,
      "player_hand_1_2_3_4_5_7_8_10_11_12_13": 959,
      "opp_cards_played_2_3_6_8_9_12": 960,
      "opp_cards_played_1_2_3_4_5_6_7_9_11_13": 961,
      "player_hand_1_4_6_7_13": 962,
      "player_hand_1_7_11": 963,
      "player_hand_8_10_13": 964,
      "opp_cards_played_6_8": 965,
      "opp_cards_played_2_3_4_5_6_7_9_10_12_13": 966,
      "player_hand_1_7_9_10_11_12_13": 967,
      "opp_cards_played_2_3_6": 968,
      "opp_cards_played_1_2_3_5_7_9_10_11_12": 969,
      "player_hand_2_6_7_8_9_10_11_12_13": 970,
      "opp_cards_played_1_2_3_6_7_9_10_11_12": 971,
      "player_hand_1_4_7_9_10_11": 972,
      "player_hand_4_8_9": 973,
      "opp_cards_played_1_2_3_4_5_6_8_9_11_12": 974,
      "opp_cards_played_2_3_4_5_6_8_9_10_11_12": 975,
      "player_hand_1_2_3_5_6_7_9_10_11_12_13": 976,
      "opp_cards_played_2_3_6_9": 977,
      "player_hand_5_6_7_13": 978,
      "player_hand_1_2_3_4_5_6_8_10_11_12_13": 979,
      "player_hand_1_2_3_4_5_6_8_9_10_11_13": 980,
      "player_hand_1_2_3_4_5_6_9_10_11_12_13": 981,
      "opp_cards_played_2_3_4_8_9_11": 982,
      "opp_cards_played_3_6_8": 983,
      "opp_cards_played_1_2_3_5_6_7_8_10_11_12": 984,
      "player_hand_1_2_4_8_10_13": 985,
      "player_hand_2_8_10_13": 986,
      "player_hand_7_8_11_12": 987,
      "player_hand_7_8_12_13": 988,
      "opp_cards_played_2_3_4_6_9_11_12": 989,
      "opp_cards_played_3_4_5_6_10_12": 990,
      "player_hand_1_2_8_10_11_12_13": 991,
      "opp_cards_played_2_3_4_6_7_9_11_12": 992,
      "opp_cards_played_1_2_3_4_5_6_8_9_10_13": 993,
      "opp_cards_played_2_3_6_8_9": 994,
      "player_hand_1_2_3_5_6_7_8_9_11_12_13": 995,
      "player_hand_1_4_7_8_11_13": 996,
      "player_hand_4_9_10_13": 997,
      "player_hand_1_2_3_4_7_8_9_10_11_12_13": 998,
      "player_hand_1_2_3_4_5_7_8_9_11_12_13": 999,
      "player_hand_1_2_3_5_6_7_8_10_11_12_13": 1000,
      "player_hand_1_4_5_6_7_10_11_12_13": 1001,
      "opp_cards_played_2_3_4_6_9_12": 1002,
      "opp_cards_played_1_3_6_7_9": 1003,
      "player_hand_1_2_3_4_5_6_7_9_11_12_13": 1004,
      "player_hand_1_2_5_7_8_9_11_13": 1005,
      "player_hand_1_2_7_8_10_13": 1006,
      "opp_cards_played_1_2_3_4_5_6_9_11_13": 1007,
      "opp_cards_played_2_3_4": 1008,
      "opp_cards_played_2_3_4_8_9_11_12": 1009,
      "player_hand_4_6_7_11_13": 1010,
      "opp_cards_played_2_3_4_9_12": 1011,
      "opp_cards_played_2_3_4_6_7_8_9_11_12_13": 1012,
      "opp_cards_played_2_3_6_9_12": 1013,
      "opp_cards_played_3_11_12": 1014,
      "player_hand_1_2_3_4_5_6_7_9_10_12_13": 1015,
      "player_hand_2_7_8_10_11_12": 1016,
      "opp_cards_played_2_3_4_5_6_9_10_11_12_13": 1017,
      "opp_cards_played_3_4_5_6_12": 1018,
      "player_hand_9_12_13": 1019,
      "player_hand_1_5_8_11_12_13": 1020,
      "opp_cards_played_1_2_3_5_6_12_13": 1021,
      "player_hand_1_10_12_13": 1022,
      "player_hand_1_2_4_6_7_8_10_13": 1023,
      "player_hand_4_7_8_9_10_11_12_13": 1024,
      "player_hand_8_10_12_13": 1025,
      "opp_cards_played_2_3_5_6_7_12": 1026,
      "player_hand_1_2_4_5_8_10_11_12_13": 1027,
      "player_hand_2_3": 1028,
      "player_hand_5_12_13": 1029,
      "opp_cards_played_2_3_4_6_10": 1030,
      "player_hand_4_7_9_12": 1031,
      "player_hand_6_9": 1032,
      "player_hand_1_2_3_4_5_6_7_8_11_12_13": 1033,
      "player_hand_1_3": 1034,
      "player_hand_3_4": 1035,
      "opp_cards_played_1_2_3_5_6_7_10_11_12_13": 1036,
      "player_hand_1_8_11_12_13": 1037,
      "player_hand_1_5_10": 1038,
      "player_hand_4_7_9_12_13": 1039,
      "opp_cards_played_1_3_5_6_7_9": 1040,
      "opp_cards_played_3_4_6_9_12": 1041,
      "player_hand_1_3_4_5_6_8_9_10_11_12_13": 1042,
      "player_hand_1_7_8_9_10_11_12_13": 1043,
      "opp_cards_played_2_3_6_7_8_9_10_11_12_13": 1044,
      "opp_cards_played_3_4_13": 1045,
      "player_hand_1_4_9_12_13": 1046,
      "player_hand_2_8_11_12_13": 1047,
      "opp_cards_played_3_4_6_12": 1048,
      "opp_cards_played_1_2_3_6_7_9_10_11_12_13": 1049,
      "opp_cards_played_3_4_6_11": 1050,
      "player_hand_7_8_10_11_12_13": 1051,
      "opp_cards_played_2_3_4_5_6_7_9_10_12": 1052,
      "player_hand_1_2_5_6_10_13": 1053,
      "player_hand_2_3_4_5_6_8_9_10_11_12_13": 1054,
      "player_hand_5_10_12_13": 1055,
      "player_hand_1_2_3_4_5_7_8_9_10_12_13": 1056,
      "opp_cards_played_2_3_4_9_10_12": 1057,
      "player_hand_1_4_7_8_11_12_13": 1058,
      "player_hand_1_6_10_13": 1059,
      "player_hand_2_7_13": 1060,
      "player_hand_4_6_7_10_12": 1061,
      "opp_cards_played_1_2_3_4_7_8_9_10_11_12": 1062,
      "opp_cards_played_2_3_8_9": 1063,
      "player_hand_1_2_3_4_6_7_8_9_10_11_12": 1064,
      "player_hand_1_2_4_5_6_8_9_10_11": 1065,
      "player_hand_1_2_5_6_8_10_13": 1066,
      "player_hand_7_11_13": 1067,
      "player_hand_7_8_9_11_12": 1068,
      "player_hand_1_2_3_4_5_7_8_9_10_11_13": 1069,
      "player_hand_2_3_4_5_7_8_9_10_11_12_13": 1070,
      "opp_cards_played_1_2_3_4_5_8_9_11_12_13": 1071,
      "opp_cards_played_1_2_3_5_6_9_12_13": 1072,
      "player_hand_1_6_7_8_11_12": 1073,
      "opp_cards_played_2_3_4_5_6_8_9_10_12_13": 1074,
      "player_hand_1_2_3_5_6_7_8_9_10_12_13": 1075,
      "player_hand_1_2_7_8_9_10_11_12": 1076,
      "player_hand_6_10": 1077,
      "opp_cards_played_3_5_8": 1078,
      "player_hand_1_4_7_11_12_13": 1079,
      "opp_cards_played_1_2_3_5_7_9_11_12": 1080,
      "prev_score_cards_1_2_3_4_5_6_7_8_10_11": 1081,
      "opp_cards_played_1_2_3_4_5_6_7_8_9_10": 1082,
      "player_hand_3_9": 1083,
      "player_hand_7_10_11_12_13": 1084,
      "player_hand_1_4_9_10_11_12_13": 1085,
      "opp_cards_played_1_2_3_4_5_6_9_11_12_13": 1086,
      "opp_cards_played_1_2_3_4_6_7_9_11_12_13": 1087,
      "opp_cards_played_2_3_4_5_6_9_10_13": 1088,
      "player_hand_1_2_5_6_7_10_12_13": 1089,
      "player_hand_1_4_5_6_7_10_13": 1090,
      "player_hand_2_4_5_6_7_8_9_10_11_12": 1091,
      "opp_cards_played_3_4_5_6_8_9_10_11_12_13": 1092,
      "opp_cards_played_3_4_6_9_11": 1093,
      "opp_cards_played_1_2_3_6_9_10_11_12": 1094,
      "player_hand_1_5_6_7_8_10_11_12": 1095,
      "player_hand_1_5_7_8_11_12": 1096,
      "opp_cards_played_1_2_3_4_5_6_8_9_11": 1097,
      "opp_cards_played_2_3_4_5_6_7_9_10_11_13": 1098,
      "opp_cards_played_1_2_3_4_5_6_7_9_12_13": 1099,
      "opp_cards_played_1_3_4_5_6_8_9_10_12_13": 1100,
      "opp_cards_played_3_6_10_11": 1101,
      "player_hand_1_5_8_11_13": 1102,
      "player_hand_3_13": 1103,
      "player_hand_4_5_8": 1104,
      "player_hand_5_6_13": 1105,
      "player_hand_1_2_4_6_8_9_10_11_13": 1106,
      "player_hand_1_2_4_7_8_9_10_12_13": 1107,
      "player_hand_1_6_7_8_11": 1108,
      "player_hand_2_3_4_6_7_8_9_10_11_12_13": 1109,
      "player_hand_1_5_6_7_8_9_11_12_13": 1110,
      "opp_cards_played_1_2_3_5_7_9_10_11_12_13": 1111,
      "player_hand_1_2_5_7_8_9_11_12": 1112,
      "player_hand_1_2_3_4_5_6_7_8_10_12_13": 1113,
      "player_hand_1_2_3_4_5_6_8_9_10_11_12": 1114,
      "player_hand_2_3_4_5_6_7_8_10_11_12_13": 1115,
      "player_hand_3_5": 1116,
      "player_hand_1_2_3_4_6_7_8_9_11_12_13": 1117,
      "player_hand_1_3_4_5_7_8_9_10_11_12_13": 1118,
      "player_hand_1_4_5_7_8_9_10_12_13": 1119,
      "player_hand_3_8": 1120,
      "player_hand_1_2_3_4_6_7_8_9_10_11_13": 1121,
      "player_hand_2_5_13": 1122,
      "player_hand_3_7": 1123,
      "player_hand_3_11": 1124,
      "opp_cards_played_1_2_3_4_5_6_8_10_12_13": 1125,
      "opp_cards_played_1_2_3_4_6_7_8_9_11_12": 1126,
      "player_hand_1_3_4_6_7_8_9_10_11_12_13": 1127,
      "player_hand_3_10": 1128,
      "opp_cards_played_2_3_5_8_9_10_11_12": 1129,
      "player_hand_1_2_7_10_13": 1130,
      "player_hand_2_8_13": 1131,
      "opp_cards_played_1_2_3_5_6_7_8_9_11_12": 1132,
      "player_hand_1_7_8_13": 1133,
      "opp_cards_played_1_2_3_4_6_8_9_10_11_12": 1134,
      "opp_cards_played_1_3_5_11_12": 1135,
      "opp_cards_played_2_3_4_6_8_9_10_11_12_13": 1136,
      "player_hand_10_11_13": 1137,
      "player_hand_1_2_4_7_9_10_11_12_13": 1138,
      "player_hand_4_5_6_7_8_10_11_12_13": 1139,
      "opp_cards_played_1_2_3_5_9_11_12": 1140,
      "player_hand_1_2_3_5_6_7_8_9_10_11_12": 1141,
      "opp_cards_played_1_2_3_4_8_9_10_11_12": 1142,
      "opp_cards_played_2_3_7_9_13": 1143,
      "player_score_69": 1144,
      "player_hand_1_7_11_12": 1145,
      "opp_cards_played_1_2_3_5_8_9_10_11_12_13": 1146,
      "opp_cards_played_3_5_6_9_11_12": 1147,
      "prev_score_cards_3_4_10": 1148,
      "opp_cards_played_3_4_7_9_12": 1149,
